{
	"personal": [
		{
			"site": "https://www.dropoffballot.com",
			"title": "dropoffballot.com",
			"pics": [
				"dropoffballot4.png",
				"dropoffballot.png",
				"dropoffballot2.png",
				"dropoffballot3.png"
			],
			"pics_desc": [
				"Dropbox View",
				"USA View",
				"MI View",
				"Ann Arbor View"
			],
			"summary": [
				"Created the first country-wide ballot dropbox and dropoff locator for the Nov 2020 General Election. Scrapped location data from State Gov't sites but mostly had to go County-by-County.",
				"After the election, tracked Restrictive bills that proposed to weaken or obstruct voting powers.",
				"Experience Gained: First time working with mapping architecture (ArgGIS, Map Tile Serving, Openmaps, and more). Maintained 2 instances from Linode to serve map tiles to my site."
			]
		},
		{
			"title": "Adalyze",
			"pics": [
				"adalyze_success.png",
				"adalyze_frame.png"
			],
			"pics_desc": [
				"Successful match found",
				"Example still frame"
			],
			"summary": [
				"Computer Vision video analyzer that calculated the optimal location for ad placement in professional sport games.",
				"Experience Gained: Amazing introduction into the Computer Vision environment (OpenCV, Numpy, Video Processing, and multithreading). Also, my first personal project working with 3rd party Cloud Providers. I purchased an EC-2 AWS cluster to offload a bulk of the GPU-heavy work."
			]
		},
		{
			"site": "https://rhcptabs.com",
			"title": "rhcptabs.com",
			"pics": [
				"rhcptabs_home.png",
				"rhcptabs.png"
			],
			"pics_desc": [
				"Home Page",
				"Album Page"
			],
			"summary": [
				"Gathered a collection of instrumental tabs for The Red Hot Chili Peppers.",
				"Featured on RHCP's main subreddit sidebar (~15K views per month).",
				"Experienced Gained: Vue.js was a new framework that I wanted to experiment with, so a quick project like this was the perfect test-run."
			]
		},
		{
			"site": "https://chrome.google.com/webstore/detail/trade-value-calculator/menkeeamkaboflpmlachemgcdgemjadh",
			"title": "Trade Value Calculator",
			"pics": [
				"trade_calc_demo.mp4",
				"tradevalue.png"
			],
			"pics_desc": [
				"Demo",
				""
			],
			"summary": [
				"Interactive Chrome and Firefox extension that uses professional trade ranks to make fantasy football trading effortless.",
				"(>5000 downloads during the season)",
				"Experience Gained: Published an Extension (or Add-On in FireFox's case) for the first time. Worked closely with users to gain realtime feedback to always be improving the experience.",
				"I also made sure to support as many websites possible (ESPN, Yahoo, NFL, CBS, Sleeper), which helped me learn how professional websites operate to the core and how to scrape the data properly."
			]
		},
		{
			"title": "MalWear",
			"pics": [
				""
			],
			"pics_desc": [
				""
			],
			"summary": [
				"Developed an online ecommerce store to sell personal Chanel products.",
				"This project provided insight into safe security practices and invaluable retail experience."
			]
		}
	],
	"professional": [
		{
			"title": "OnRoto Fantasy Sports",
			"pics": [
				"team_home_mob.png",
				"team_home_desktop.png",
				"trans_mob.png",
				"trans_desktop.png"
			],
			"pics_desc": [
				"Team Home page (mobile)",
				"Team Home page (desktop)",
				"Transactions page (mobile)",
				"Transactions page (desktop)"
			],
			"summary": [
				"Planned and implemented a mobile UX.",
				"Replaced all existing Java functionality with JavaScript. With Java being depreciated across the web, it seemed unreliable to have some pages still rely on it."
			]
		},
		{
			"title": "The Purple Ones",
			"pics": [
				"tpo2.png",
				"tpo1.png"
			],
			"pics_desc": [
				"Landing Screen",
				"Updated Song List"
			],
			"summary": [
				"Managed the frontend and backend for a Prince cover band running on Wordpress.",
				"Reduced the load time by 50% by compressing images, optimizing JavaScript, and removing unnecessary styles and scripts."
			]
		},
		{
			"title": "Elite Lessons",
			"pics": [
				"EL1.png",
				"EL2.png",
				"EL3.png",
				"EL4.png"
			],
			"pics_desc": [
				"Landing Page",
				"Search Page",
				"Profile Page",
				"Appointment Page"
			],
			"summary": [
				"Researched and practiced the necessary languages, from scratch, to make a professional website for a startup company.",
				"With the help of Parse to handle the backend database, more focus could be placed on learning HTML/CSS/JS and the frontend."
			]
		}
	]
}